# https://github.com/Homebrew/homebrew-bundle

# need device password
cask "1password/tap/1password-cli"
cask "google-cloud-sdk"

# cask "EasyRres" # https://apps.apple.com/jp/app/easyres/id688211836
cask "DaisyDisk"
cask "evernote"
cask "font-fira-code-nerd-font"
cask "font-Hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "ngrok"
cask "postman"
cask "slack-cli"
cask "spotify"
cask "tabby"
cask "raycast"
cask "warp"

tap "ankitpokhrel/jira-cli"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "teamookla/speedtest"

brew "act"
brew "anyenv"
brew "bat"
brew "circleci"
brew "cloc"
brew "coreutils"
brew "eza"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "gitmoji"
brew "graphviz"
brew "jira-cli"
brew "jp2a"
brew "jq"
brew "neofetch"
brew "neovim"
brew "node-build"
brew "peco"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "sl"
brew "starship" # fish prompt https://github.com/starship/starship
brew "tfenv"
brew "tig"
brew "tmux"
brew "translate-shell"
brew "vercel-cli"

brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
