# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/cask"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"

brew "act"
brew "circleci"
brew "coreutils"
brew "exa"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "gitmoji"
brew "graphviz"
brew "heroku"
brew "jira-cli"
brew "jp2a"
brew "jq"
brew "neofetch"
brew "neovim"
brew "nodenv"
brew "peco"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "sl"
brew "speedtest"
brew "starship" # fish prompt https://github.com/starship/starship
brew "tfenv"
brew "tmux"
brew "translate-shell"
brew "vercel-cli"

brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "1password/tap/1password-cli"
# cask "EasyRres" # https://apps.apple.com/jp/app/easyres/id688211836
cask "evernote"
cask "font-fira-code-nerd-font"
cask "font-Hack-nerd-font"
cask "google-cloud-sdk"
cask "postman"
cask "spotify"
cask "raycast"
cask "warp"
