tap "homebrew/bundle"
tap "teamookla/speedtest"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Statistics utility to count lines of code
brew "cloc"
# Modern, maintained replacement for ls
brew "eza"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Simplistic interactive filtering tool
brew "peco"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Password manager
cask "1password@nightly"
# Enable Windows-like alt-tab
cask "alt-tab"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Write, edit, and chat about your code with AI
cask "cursor"
# Client for the Dropbox cloud storage service
cask "dropbox"
# App for note taking, organising, task lists, and archiving
cask "evernote"
# Collaborative team software
cask "figma"
# Virtual video-calling space
cask "gather"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Japanese input software
cask "google-japanese-ime"
# Open-source keystroke visualiser
cask "keycastr"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
mas "Monosnap", id: 540348655
mas "RunCat", id: 1429033973
