oh-my-fish/plugin-peco
jethrokuan/z
jorgebucaran/fisher
b4b4r07/enhancd
jethrokuan/fzf
wfxr/forgit
dracula/fish
h-matsuo/fish-color-scheme-switcher
